#### Ref: 
http://queirozf.com/entries/pandas-dataframe-replace-examples

In [2]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [4]:
import pandas as pd

### Replace a value

In [5]:
df = pd.DataFrame({
    'name':['john','mary','paul'],
    'age':[30,25,40],
    'city':['new york','los angeles','london']
})

df
df.replace([25,30], [250,300])

   age         city  name
0   30     new york  john
1   25  los angeles  mary
2   40       london  paul

   age         city  name
0  300     new york  john
1  250  los angeles  mary
2   40       london  paul

### Replace a value in a column

In [6]:
import pandas as pd

df = pd.DataFrame({
    'name':['john','mary','paul'],
    'num_children':[0,4,5],
    'num_pets':[0,1,2]
})

df
df.replace({'num_pets':{0:1}})

   name  num_children  num_pets
0  john             0         0
1  mary             4         1
2  paul             5         2

   name  num_children  num_pets
0  john             0         1
1  mary             4         1
2  paul             5         2

### Replace with regex

In [7]:
df = pd.DataFrame({
    'name':['john','mary','paul'],
    'age':[30,25,40],
    'city':['new york','los angeles','london']
})

df
df.replace('jo.+','FOO',regex=True)

   age         city  name
0   30     new york  john
1   25  los angeles  mary
2   40       london  paul

   age         city  name
0   30     new york   FOO
1   25  los angeles  mary
2   40       london  paul

### Replace with `dict`

In [8]:
import pandas as pd

df = pd.DataFrame({
    'name':['john','mary','paul'],
    'age':[30,25,40],
    'city':['new york','los angeles','london']
})

df
df.replace({
    25:26,
    'john':'johnny'
})

   age         city  name
0   30     new york  john
1   25  los angeles  mary
2   40       london  paul

   age         city    name
0   30     new york  johnny
1   26  los angeles    mary
2   40       london    paul

## Replace at a location with `.loc`

In [9]:
df

   age         city  name
0   30     new york  john
1   25  los angeles  mary
2   40       london  paul

In [11]:
df.loc[df['city'] == 'new york', 'city'] = 'taiping'
df

   age         city  name
0   30      taiping  john
1   25  los angeles  mary
2   40       london  paul